# FaceEdgeNode Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceEdgeNode Class
Members See Also
---
An output node that represents a Face edge.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public class FaceEdgeNode : FaceDetailNode
```

Visual Basic
---
```text
Public Class FaceEdgeNode _
	Inherits FaceDetailNode
```

Visual C++
---
```text
public ref class FaceEdgeNode : public FaceDetailNode
```

# Remarks
See also: [!:Autodesk::Revit::DB::IExportContext2D::OnFaceEdge2D].
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..FaceDetailNode Autodesk.Revit.DB..::..FaceEdgeNode
# See Also
FaceEdgeNode Members
Autodesk.Revit.DB Namespace